## Staging: lambda
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 43 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                               |
|--------|-----------------------------------------------------------------|
| add    | `aws_cloudwatch_event_rule.problem_commit_schedule`             |
|        | `aws_cloudwatch_event_rule.toptask_survey_commit_schedule`      |
|        | `aws_cloudwatch_event_target.problem_commit_schedule`           |
|        | `aws_cloudwatch_event_target.toptask_survey_commit_schedule`    |
|        | `aws_cloudwatch_log_group.problem_commit`                       |
|        | `aws_cloudwatch_log_group.queue_problem`                        |
|        | `aws_cloudwatch_log_group.queue_problem_form`                   |
|        | `aws_cloudwatch_log_group.queue_toptask`                        |
|        | `aws_cloudwatch_log_group.queue_toptask_survey_form`            |
|        | `aws_cloudwatch_log_group.toptask_survey_commit`                |
|        | `aws_iam_role.problem_commit_lambda`                            |
|        | `aws_iam_role.queue_problem_form_lambda`                        |
|        | `aws_iam_role.queue_problem_lambda`                             |
|        | `aws_iam_role.queue_toptask_lambda`                             |
|        | `aws_iam_role.queue_toptask_survey_form_lambda`                 |
|        | `aws_iam_role.toptask_survey_commit_lambda`                     |
|        | `aws_iam_role_policy_attachment.problem_commit_sqs`             |
|        | `aws_iam_role_policy_attachment.problem_commit_ssm`             |
|        | `aws_iam_role_policy_attachment.problem_commit_vpc`             |
|        | `aws_iam_role_policy_attachment.queue_problem_form_logs`        |
|        | `aws_iam_role_policy_attachment.queue_problem_form_sqs`         |
|        | `aws_iam_role_policy_attachment.queue_problem_logs`             |
|        | `aws_iam_role_policy_attachment.queue_problem_sqs`              |
|        | `aws_iam_role_policy_attachment.queue_toptask_logs`             |
|        | `aws_iam_role_policy_attachment.queue_toptask_sqs`              |
|        | `aws_iam_role_policy_attachment.queue_toptask_survey_form_logs` |
|        | `aws_iam_role_policy_attachment.queue_toptask_survey_form_sqs`  |
|        | `aws_iam_role_policy_attachment.toptask_survey_commit_sqs`      |
|        | `aws_iam_role_policy_attachment.toptask_survey_commit_ssm`      |
|        | `aws_iam_role_policy_attachment.toptask_survey_commit_vpc`      |
|        | `aws_lambda_function.problem_commit`                            |
|        | `aws_lambda_function.queue_problem`                             |
|        | `aws_lambda_function.queue_problem_form`                        |
|        | `aws_lambda_function.queue_toptask`                             |
|        | `aws_lambda_function.queue_toptask_survey_form`                 |
|        | `aws_lambda_function.toptask_survey_commit`                     |
|        | `aws_lambda_permission.problem_commit_eventbridge`              |
|        | `aws_lambda_permission.queue_problem_sns`                       |
|        | `aws_lambda_permission.queue_toptask_sns`                       |
|        | `aws_lambda_permission.toptask_survey_commit_eventbridge`       |
|        | `aws_security_group.lambda_sg`                                  |
|        | `aws_sns_topic_subscription.problem_to_lambda`                  |
|        | `aws_sns_topic_subscription.toptask_to_lambda`                  |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/gc-feedback-collection-api/actions/runs/19299119958).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.problem_commit_schedule will be created
  + resource "aws_cloudwatch_event_rule" "problem_commit_schedule" {
      + arn                 = (known after apply)
      + description         = "Trigger problem_commit Lambda every 2 minutes"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "feedback-collection-api-problem-commit-schedule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(2 minutes)"
      + tags                = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_rule.toptask_survey_commit_schedule will be created
  + resource "aws_cloudwatch_event_rule" "toptask_survey_commit_schedule" {
      + arn                 = (known after apply)
      + description         = "Trigger toptask_survey_commit Lambda every 2 minutes"
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "feedback-collection-api-toptask-survey-commit-schedule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(2 minutes)"
      + tags                = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all            = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_target.problem_commit_schedule will be created
  + resource "aws_cloudwatch_event_target" "problem_commit_schedule" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "feedback-collection-api-problem-commit-schedule"
      + target_id      = "problem-commit-lambda"
    }

  # aws_cloudwatch_event_target.toptask_survey_commit_schedule will be created
  + resource "aws_cloudwatch_event_target" "toptask_survey_commit_schedule" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "feedback-collection-api-toptask-survey-commit-schedule"
      + target_id      = "toptask-survey-commit-lambda"
    }

  # aws_cloudwatch_log_group.problem_commit will be created
  + resource "aws_cloudwatch_log_group" "problem_commit" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/feedback-collection-api-problem-commit"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.queue_problem will be created
  + resource "aws_cloudwatch_log_group" "queue_problem" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/feedback-collection-api-queue-problem"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.queue_problem_form will be created
  + resource "aws_cloudwatch_log_group" "queue_problem_form" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/feedback-collection-api-queue-problem-form"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.queue_toptask will be created
  + resource "aws_cloudwatch_log_group" "queue_toptask" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/feedback-collection-api-queue-toptask"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.queue_toptask_survey_form will be created
  + resource "aws_cloudwatch_log_group" "queue_toptask_survey_form" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/feedback-collection-api-queue-toptask-survey-form"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_log_group.toptask_survey_commit will be created
  + resource "aws_cloudwatch_log_group" "toptask_survey_commit" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/feedback-collection-api-toptask-survey-commit"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.problem_commit_lambda will be created
  + resource "aws_iam_role" "problem_commit_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "feedback-collection-api-problem-commit-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.queue_problem_form_lambda will be created
  + resource "aws_iam_role" "queue_problem_form_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "feedback-collection-api-queue-problem-form-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.queue_problem_lambda will be created
  + resource "aws_iam_role" "queue_problem_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "feedback-collection-api-queue-problem-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.queue_toptask_lambda will be created
  + resource "aws_iam_role" "queue_toptask_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "feedback-collection-api-queue-toptask-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.queue_toptask_survey_form_lambda will be created
  + resource "aws_iam_role" "queue_toptask_survey_form_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "feedback-collection-api-queue-toptask-survey-form-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.toptask_survey_commit_lambda will be created
  + resource "aws_iam_role" "toptask_survey_commit_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "feedback-collection-api-toptask-survey-commit-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.problem_commit_sqs will be created
  + resource "aws_iam_role_policy_attachment" "problem_commit_sqs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::123456789012:policy/mock-lambda-sqs-receive-policy"
      + role       = "feedback-collection-api-problem-commit-lambda-role"
    }

  # aws_iam_role_policy_attachment.problem_commit_ssm will be created
  + resource "aws_iam_role_policy_attachment" "problem_commit_ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::123456789012:policy/mock-lambda-ssm-policy"
      + role       = "feedback-collection-api-problem-commit-lambda-role"
    }

  # aws_iam_role_policy_attachment.problem_commit_vpc will be created
  + resource "aws_iam_role_policy_attachment" "problem_commit_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "feedback-collection-api-problem-commit-lambda-role"
    }

  # aws_iam_role_policy_attachment.queue_problem_form_logs will be created
  + resource "aws_iam_role_policy_attachment" "queue_problem_form_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "feedback-collection-api-queue-problem-form-lambda-role"
    }

  # aws_iam_role_policy_attachment.queue_problem_form_sqs will be created
  + resource "aws_iam_role_policy_attachment" "queue_problem_form_sqs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::123456789012:policy/mock-lambda-sqs-policy"
      + role       = "feedback-collection-api-queue-problem-form-lambda-role"
    }

  # aws_iam_role_policy_attachment.queue_problem_logs will be created
  + resource "aws_iam_role_policy_attachment" "queue_problem_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "feedback-collection-api-queue-problem-lambda-role"
    }

  # aws_iam_role_policy_attachment.queue_problem_sqs will be created
  + resource "aws_iam_role_policy_attachment" "queue_problem_sqs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::123456789012:policy/mock-lambda-sqs-policy"
      + role       = "feedback-collection-api-queue-problem-lambda-role"
    }

  # aws_iam_role_policy_attachment.queue_toptask_logs will be created
  + resource "aws_iam_role_policy_attachment" "queue_toptask_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "feedback-collection-api-queue-toptask-lambda-role"
    }

  # aws_iam_role_policy_attachment.queue_toptask_sqs will be created
  + resource "aws_iam_role_policy_attachment" "queue_toptask_sqs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::123456789012:policy/mock-lambda-sqs-policy"
      + role       = "feedback-collection-api-queue-toptask-lambda-role"
    }

  # aws_iam_role_policy_attachment.queue_toptask_survey_form_logs will be created
  + resource "aws_iam_role_policy_attachment" "queue_toptask_survey_form_logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "feedback-collection-api-queue-toptask-survey-form-lambda-role"
    }

  # aws_iam_role_policy_attachment.queue_toptask_survey_form_sqs will be created
  + resource "aws_iam_role_policy_attachment" "queue_toptask_survey_form_sqs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::123456789012:policy/mock-lambda-sqs-policy"
      + role       = "feedback-collection-api-queue-toptask-survey-form-lambda-role"
    }

  # aws_iam_role_policy_attachment.toptask_survey_commit_sqs will be created
  + resource "aws_iam_role_policy_attachment" "toptask_survey_commit_sqs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::123456789012:policy/mock-lambda-sqs-receive-policy"
      + role       = "feedback-collection-api-toptask-survey-commit-lambda-role"
    }

  # aws_iam_role_policy_attachment.toptask_survey_commit_ssm will be created
  + resource "aws_iam_role_policy_attachment" "toptask_survey_commit_ssm" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::123456789012:policy/mock-lambda-ssm-policy"
      + role       = "feedback-collection-api-toptask-survey-commit-lambda-role"
    }

  # aws_iam_role_policy_attachment.toptask_survey_commit_vpc will be created
  + resource "aws_iam_role_policy_attachment" "toptask_survey_commit_vpc" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "feedback-collection-api-toptask-survey-commit-lambda-role"
    }

  # aws_lambda_function.problem_commit will be created
  + resource "aws_lambda_function" "problem_commit" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./.terraform/lambda-problem-commit.zip"
      + function_name                  = "feedback-collection-api-problem-commit"
      + handler                        = "problem_commit.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "Yr9SC7FfVrUwZPOAhqrlwKA498ni61kLSmEmlX2rto8="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENVIRONMENT"          = "staging"
              + "MONGO_DB"             = "pagesuccess"
              + "MONGO_PASSWORD_PARAM" = "arn:aws:ssm:ca-central-1:992382783569:parameter/feedback-cronjob/staging/docdb-password"
              + "MONGO_PORT"           = "27017"
              + "MONGO_URL"            = "feedback-cronjob-docdb-cluster.cluster-c52kwceay79r.ca-central-1.docdb.amazonaws.com"
              + "MONGO_USERNAME_PARAM" = "arn:aws:ssm:ca-central-1:992382783569:parameter/feedback-cronjob/staging/docdb-username"
              + "PROBLEM_QUEUE_URL"    = "https://sqs.ca-central-1.amazonaws.com/123456789012/mock-problem-queue"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = (known after apply)
          + subnet_ids                  = [
              + "subnet-089ba77b72ba4e7ef",
              + "subnet-08d75a1492fee6cbd",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # aws_lambda_function.queue_problem will be created
  + resource "aws_lambda_function" "queue_problem" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./.terraform/lambda-queue-problem.zip"
      + function_name                  = "feedback-collection-api-queue-problem"
      + handler                        = "queue_problem.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "Yr9SC7FfVrUwZPOAhqrlwKA498ni61kLSmEmlX2rto8="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENVIRONMENT"       = "staging"
              + "PROBLEM_QUEUE_URL" = "https://sqs.ca-central-1.amazonaws.com/123456789012/mock-problem-queue"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.queue_problem_form will be created
  + resource "aws_lambda_function" "queue_problem_form" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./.terraform/lambda-queue-problem-form.zip"
      + function_name                  = "feedback-collection-api-queue-problem-form"
      + handler                        = "queue_problem_form.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "Yr9SC7FfVrUwZPOAhqrlwKA498ni61kLSmEmlX2rto8="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENVIRONMENT"       = "staging"
              + "PROBLEM_QUEUE_URL" = "https://sqs.ca-central-1.amazonaws.com/123456789012/mock-problem-queue"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.queue_toptask will be created
  + resource "aws_lambda_function" "queue_toptask" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./.terraform/lambda-queue-toptask.zip"
      + function_name                  = "feedback-collection-api-queue-toptask"
      + handler                        = "queue_toptask.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.11"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "Yr9SC7FfVrUwZPOAhqrlwKA498ni61kLSmEmlX2rto8="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "feedback-collection-api-staging"
          + "Terraform"  = "true"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              +...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
